// @ts-check
/* eslint-disable no-unused-vars */
const version = '2021/11/10 v0.0767';

const itemdata_url = 'data/itemData.json';
const textdata_url = 'data/textData.json';

/** @type {Object<number, string>} */
const status_type = {
  0: "レベル",
  1: "力",
  2: "敏捷",
  3: "健康",
  4: "知恵",
  5: "知識",
  6: "カリスマ",
  7: "運"
};

/** @type {Object<number, string>} */
const extra_status_type = {
  0: "レベル",
  1: "力",
  2: "敏捷",
  3: "健康",
  4: "カリスマ",
  5: "知識",
  6: "知恵",
  7: "運"
};

/** @type {Object<number, string>} */
const minipet_food_type = {
  1: "精霊型",
  2: "自然型",
  3: "神霊型"
};

/** @type {Object<number, string>} */
const job_type = {
  0: "剣士",
  1: "戦士",
  2: "ウィザード",
  3: "ウルフマン",
  4: "ビショップ",
  5: "追放天使",
  6: "シーフ",
  7: "武道家",
  8: "ランサー",
  9: "アーチャー",
  10: "ビーストテイマ―",
  11: "サマナー",
  12: "プリンセス",
  13: "リトルウィッチ",
  14: "ネクロマンサー",
  15: "悪魔",
  16: "霊術師",
  17: "闘士",
  18: "光奏師",
  19: "獣人",
  20: "メイド",
  21: "黒魔術師",
  22: "マスケッティア",
  23: "アルケミスト",
  40: "男性キャラクター専用", // original
  41: "女性キャラクター専用"  // original
};

/** @type {Object<number, string>} */
const item_type = {
  0: "ヘルメット",
  1: "冠",
  2: "グローブ",
  3: "投擲機",
  4: "爪",
  5: "手首",
  6: "ベルト",
  7: "ブーツ",
  8: "ネックレス",
  9: "リング",
  10: "イヤリング",
  11: "マント",
  12: "ブローチ",
  13: "腕刺青",
  14: "肩刺青",
  15: "十字架",
  16: "共用鎧",
  17: "職業鎧",
  18: "片手剣",
  19: "盾",
  20: "両手剣",
  21: "杖",
  22: "牙",
  23: "メイス",
  24: "翼",
  25: "短剣",
  26: "弓",
  27: "矢",
  28: "槍",
  29: "笛",
  30: "スリング",
  31: "スリング弾丸",
  32: "ワンド",
  33: "鞭",
  34: "宝石",
  35: "HP回復",
  36: "CP回復",
  37: "能力向上1",
  38: "能力向上2",
  39: "異常回復1",
  40: "異常回復2",
  41: "鍵",
  42: "移動",
  43: "必殺技",
  44: "イベント1",
  45: "ステータス上昇",
  46: "魔力補充",
  47: "セッティング宝石",
  48: "イベント2",
  49: "クエスト",
  50: "課金",
  51: "エンチャント・露店",
  52: "BOX",
  53: "",
  54: "鎌",
  55: "クロー",
  56: "本",
  57: "ほうき",
  58: "双剣",
  59: "コスチューム",
  60: "クレスト",
  61: "ダークコア",
  62: "",
  63: "双拳銃",
  64: "魔弾石",
  65: "超越N",
  66: "超越R",
  67: "超越U",
  68: "錬金石",
  69: "触媒石",
  70: "格闘武器",
  71: "鞘",
  72: "マスターキー",
  73: "保護帯",
  74: "獣毛装飾",
  75: "星群",
  76: "契約霊",
  77: "ウォーペイント",
  78: "コサージュ",
};

/** @type {Array<number>} */
const not_equipment = [
  35, 36, 37, 38, 39, 40, 41, 42, 43, 44, 45, 46, 47, 48, 49, 50, 51, 52,
  53, 59, 60, 62, 65, 66, 67, 68
];

const type_categories = [
  ['武器',
    ['剣士・戦士', [18, 19, 20, 71]],
    ['ランサー・アーチャー', [26, 27, 28, 3, 13]],
    ['ウィザード・ウルフマン', [21, 12, 22, 74]],
    ['ビショップ・追放天使', [23, 19, 24, 15]],
    ['ビーストテイマー・サマナー', [29, 14]],
    ['シーフ・武道家', [25, 72, 70, 73]],
    ['プリンセス・リトルウィッチ', [30, 31, 32, 75]],
    ['ネクロマンサー・悪魔', [33, 15]],
    ['霊術師・闘士', [54, 76, 55, 77]],
    ['光奏師・獣人', [56, 58, 12]],
    ['メイド・黒魔術師', [57, 78, 61, 15]],
    ['マスケッティア・アルケミスト', [63, 64, 68, 69]]
  ],
  ['防具', [8, 0, 1, 11, 10, 6, 2, 4, 5, 16, 17, 7, 9]],
  ['その他', [
    34, 35, 36, 37, 38, 39, 40, 41, 42, 43, 44, 45, 46, 47, 48, 49, 50,
    51, 52, 59, 60, 65, 66, 67,
  ]]
];
